app/controllers/repositories_controller.rb

SELECT "repositories".* FROM "repositories" GROUP BY "repositories"."language"
---
  def index
    @repository_by_language = Repository.group(:language)

SELECT "repositories".* FROM "repositories" WHERE "repositories"."language" = ? AND "repositories"."category" = ?  [["language", "Ruby"], ["category", "Authentication"]]
---
  def show
    @repositories = Repository.where(language: params[:id], category: params[:category])

SELECT "repositories".* FROM "repositories" WHERE "repositories"."language" = ? GROUP BY "repositories"."category"  [["language", "ruby"]]
---
  def category
    @language = params[:id]
    @repositories = Repository.where(language: params[:id]).group(:category)

INSERT INTO "repositories" ("language", "category", "public_url", "created_at", "updated_at", "title", "stargazerCount", "forkCount", "lastUpdatedAt") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @repository = Repository.new(repository_params)

    respond_to do |format|
      if @repository.save

SELECT "repositories".* FROM "repositories" WHERE "repositories"."language" = ? LIMIT ?  [["language", "ruby"], ["LIMIT", 1]]
---
    def set_repository
      @repository = Repository.where(language: params[:id]).group(:category)